In [1]:
import pandas as pd

In [2]:
x = pd.DataFrame({
    "RollNo": [101, 102, 103, 104],
    "Name": ["abd", "pqr", "xyz", "mno"]})

In [3]:
x

   RollNo Name
0     101  abd
1     102  pqr
2     103  xyz
3     104  mno

In [4]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  4 non-null      int64
 1   Name    4 non-null      object
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [5]:
x.describe()

           RollNo
count    4.000000
mean   102.500000
std      1.290994
min    101.000000
25%    101.750000
50%    102.500000
75%    103.250000
max    104.000000

In [6]:
x.isnull()

   RollNo   Name
0   False  False
1   False  False
2   False  False
3   False  False

In [7]:
x.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [8]:
x.head(3)

   RollNo Name
0     101  abd
1     102  pqr
2     103  xyz

In [9]:
x.tail(2)

   RollNo Name
2     103  xyz
3     104  mno

In [10]:
type(x)

pandas.core.frame.DataFrame

In [11]:
type(x.RollNo)

pandas.core.series.Series

In [12]:
type(x.Name)

pandas.core.series.Series